IDEA Open Model
Beam.Edges Property
 Lines of Element2D including edges, which are created by opening
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<ReferenceElement> Edges { get; set; }
Public Property Edges As List(Of ReferenceElement)
	Get
	Set
public:
virtual property List<ReferenceElement^>^ Edges {
	List<ReferenceElement^>^ get () sealed;
	void set (List<ReferenceElement^>^ value) sealed;
}
Property Value
Type: List<ReferenceElement>
Implements
IGeometryPart.Edges
See Also
Reference
Beam Class
IdeaRS.OpenModel.Detail Namespace